src/cf/InformationRegisters/ОчередьСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСообщений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЗаписанВЖурнал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/РегламентныеИФоновыеЗадачиСКУД/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции 
 
 Процедура ОбработкаНовыхСообщений()Экспорт      
     
     Запрос = Новый Запрос;
     Запрос.Текст = 
     "ВЫБРАТЬ
     |  ОчередьСообщений.ЗаписанВЖурнал КАК ЗаписанВЖурнал,
     |  ОчередьСообщений.Сообщение КАК Сообщение
     |ИЗ
     |  РегистрСведений.ОчередьСообщений КАК ОчередьСообщений
     |ГДЕ
     |  ОчередьСообщений.ЗаписанВЖурнал <> ИСТИНА";
     РезультатЗапроса = Запрос.Выполнить();
     ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
     Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
         РегистрыСведений.ЖурналСобытий.ЗаписатьСобытиеВЖурнал(ВыборкаДетальныеЗаписи.Сообщение);  
         Набор = РегистрыСведений.ОчередьСообщений.СоздатьНаборЗаписей(); 
         Набор.Отбор.Сообщение.Установить(ВыборкаДетальныеЗаписи.Сообщение); 
         
         Набор.Прочитать();
         Если Набор.Количество() <> 0 Тогда
             Для Каждого стрНабора из Набор Цикл
                 стрНабора.ЗаписанВЖурнал = Истина;
             КонецЦикла;
             Набор.Записать();
         КонецЕсли;
         
     КонецЦикла;
     
 КонецПроцедуры
 
 #КонецОбласти
